## Do necessary Imports

In [1]:
import pandas as pd
import numpy as np

### Create Empty Data Frame

In [2]:
df = pd.DataFrame()
print (df)

Empty DataFrame
Columns: []
Index: []

### Add columns with List to empty Data Frame

In [4]:
colName = ['Tom', 'Jack', 'Steve', 'Ricky']
colAge  = [28,34,29,42]
colSal  = [5000.0, 5500.0, 6000, 4000.0]

df = pd.DataFrame(index=[1, 2, 3, 4], dtype=float)

df['Name'] = colName
df['Age'] = colAge
df['Salary'] = colSal
print (df)
print(type(df['Name'])) # It clearly means that when List is stored as column in Data Frame it goes there as Series.

    Name  Age  Salary
1    Tom   28  5000.0
2   Jack   34  5500.0
3  Steve   29  6000.0
4  Ricky   42  4000.0
<class 'pandas.core.series.Series'>

### Add columns with Series to empty Data Frame

In [5]:
colName = pd.Series(['Tom', 'Jack', 'Steve', 'Ricky'])
colAge  = pd.Series([28,34,29,42])
colBasSal  = pd.Series([5000.0, 5500.0, 6000, 4000.0])
idxSeries = pd.Series([1, 2, 3, 4])

df = pd.DataFrame(index=idxSeries, dtype=float)

df['Name'] = colName
df['Age'] = colAge
df['Salary'] = colBasSal
print (df)
print(type(df['Name'])) # It clearly means that when List is stored as column in Data Frame it goes there as Series.

    Name   Age  Salary
1   Jack  34.0  5500.0
2  Steve  29.0  6000.0
3  Ricky  42.0  4000.0
4    NaN   NaN     NaN
<class 'pandas.core.series.Series'>

### Adding two columns to create a third column

In [6]:
colName = ['Tom', 'Jack', 'Steve', 'Ricky']
colAge  = [28,34,29,42]
colBasSal  = [5000.0, 5500.0, 6000, 4000.0]
colPerks   = [500.0, 550.0, 600, 400.0]

df = pd.DataFrame(index=[1, 2, 3, 4], dtype=float)

df['Name'] = colName
df['Age'] = colAge
df['BasSalary'] = colBasSal
df['Perks'] = colPerks
df['TotalSal'] = df['BasSalary'] + df['Perks']
print(df)

    Name  Age  BasSalary  Perks  TotalSal
1    Tom   28     5000.0  500.0    5500.0
2   Jack   34     5500.0  550.0    6050.0
3  Steve   29     6000.0  600.0    6600.0
4  Ricky   42     4000.0  400.0    4400.0

### Delete a column using del and pop

In [7]:
colName = ['Tom', 'Jack', 'Steve', 'Ricky']
colAge  = [28,34,29,42]
colBasSal  = [5000.0, 5500.0, 6000, 4000.0]
colPerks   = [500.0, 550.0, 600, 400.0]

df = pd.DataFrame(index=[1, 2, 3, 4], dtype=float)

df['Name'] = colName
df['Age'] = colAge
df['BasSalary'] = colBasSal
df['Perks'] = colPerks
df['TotalSal'] = df['BasSalary'] + df['Perks']

print("Delete a BasSalary Column")
del(df['BasSalary'])
print(df)

print("Pop a Perks Salary")
df.pop('Perks')
print(df)

Delete a BasSalary Column
    Name  Age  Perks  TotalSal
1    Tom   28  500.0    5500.0
2   Jack   34  550.0    6050.0
3  Steve   29  600.0    6600.0
4  Ricky   42  400.0    4400.0
Pop a Perks Salary
    Name  Age  TotalSal
1    Tom   28    5500.0
2   Jack   34    6050.0
3  Steve   29    6600.0
4  Ricky   42    4400.0

### Access employee details using index

In [9]:
colName = ['Tom', 'Jack', 'Steve', 'Ricky']
colAge  = [28,34,29,42]
colBasSal  = [5000.0, 5500.0, 6000, 4000.0]
colPerks   = [500.0, 550.0, 600, 400.0]

df = pd.DataFrame(index=[1, 2, 3, 4], dtype=float)

df['Name'] = colName
df['Age'] = colAge
df['BasSalary'] = colBasSal
df['Perks'] = colPerks
df['TotalSal'] = df['BasSalary'] + df['Perks']
print(df.loc[1])

Name          Tom
Age            28
BasSalary    5000
Perks         500
TotalSal     5500
Name: 1, dtype: object

### Access employee details using subscript

In [10]:
print(df.iloc[0])

Name          Tom
Age            28
BasSalary    5000
Perks         500
TotalSal     5500
Name: 1, dtype: object

### Creating new Data Frame using Sclicing

In [12]:
print(df[0:3])

    Name  Age  BasSalary  Perks  TotalSal
1    Tom   28     5000.0  500.0    5500.0
2   Jack   34     5500.0  550.0    6050.0
3  Steve   29     6000.0  600.0    6600.0

### Append new rows

In [25]:
colName = ['Sachin', 'Suresh', 'Ramesh', 'Rashmi']
colAge  = [29,35,30,43]
colBasSal  = [5001.0, 5501.0, 6001, 4001.0]
colPerks   = [501.0, 551.0, 601, 401.0]

# df1 = pd.DataFrame(index=[5, 6, 7, 8], dtype=float)
df1 = pd.DataFrame(index=[1, 2, 3, 4], dtype=float)
df1['Name'] = colName
df1['Age'] = colAge
df1['BasSalary'] = colBasSal
df1['Perks'] = colPerks
df1['TotalSal'] = df1['BasSalary'] + df1['Perks']

# Append one Data Frame to another data frame
df2 = df.append(df1)
print(df2)

     Name  Age  BasSalary  Perks  TotalSal
1     Tom   28     5000.0  500.0    5500.0
2    Jack   34     5500.0  550.0    6050.0
3   Steve   29     6000.0  600.0    6600.0
4   Ricky   42     4000.0  400.0    4400.0
1  Sachin   29     5001.0  501.0    5502.0
2  Suresh   35     5501.0  551.0    6052.0
3  Ramesh   30     6001.0  601.0    6602.0
4  Rashmi   43     4001.0  401.0    4402.0

### Deletion of Rows

In [26]:
df3 = df2.drop(1)
print(df3)

     Name  Age  BasSalary  Perks  TotalSal
2    Jack   34     5500.0  550.0    6050.0
3   Steve   29     6000.0  600.0    6600.0
4   Ricky   42     4000.0  400.0    4400.0
2  Suresh   35     5501.0  551.0    6052.0
3  Ramesh   30     6001.0  601.0    6602.0
4  Rashmi   43     4001.0  401.0    4402.0

### Other row wise action

#### Using head()

In [27]:
df3.head(3)

    Name  Age  BasSalary  Perks  TotalSal
2   Jack   34     5500.0  550.0    6050.0
3  Steve   29     6000.0  600.0    6600.0
4  Ricky   42     4000.0  400.0    4400.0

#### Using Shape

In [29]:
df3.shape

(6, 5)

#### Calculating length

In [41]:
print(len(df3))

6

### Filter for Salary >5000

In [34]:
# Create df1
colName1 = ['Tom', 'Jack', 'Steve', 'Ricky']
colAge1  = [28,34,29,42]
colBasSal1  = [5000.0, 5500.0, 6000, 4000.0]
colPerks1   = [500.0, 550.0, 600, 400.0]

df1 = pd.DataFrame(index=[1, 2, 3, 4], dtype=float)

df1['Name'] = colName1
df1['Age'] = colAge1
df1['BasSalary'] = colBasSal1
df1['Perks'] = colPerks1
df1['TotalSal'] = df1['BasSalary'] + df1['Perks']


colName2 = ['Sachin', 'Suresh', 'Ramesh', 'Rashmi']
colAge2  = [29,35,30,43]
colBasSal2  = [5001.0, 5501.0, 6001, 4001.0]
colPerks2   = [501.0, 551.0, 601, 401.0]

df2 = pd.DataFrame(index=[5, 6, 7, 8], dtype=float)
df2['Name'] = colName
df2['Age'] = colAge
df2['BasSalary'] = colBasSal
df2['Perks'] = colPerks
df2['TotalSal'] = df2['BasSalary'] + df2['Perks']

# Append one Data Frame to another data frame
df3 = df1.append(df2)

print("Appended Data Frames...")
print(df3)
print('--------------------------------------------')
print("Filtered Data Frames..")
df_filtered = df[df['Age'] >= 30] 
print(df_filtered)

Appended Data Frames...
     Name  Age  BasSalary  Perks  TotalSal
1     Tom   28     5000.0  500.0    5500.0
2    Jack   34     5500.0  550.0    6050.0
3   Steve   29     6000.0  600.0    6600.0
4   Ricky   42     4000.0  400.0    4400.0
5  Sachin   29     5001.0  501.0    5502.0
6  Suresh   35     5501.0  551.0    6052.0
7  Ramesh   30     6001.0  601.0    6602.0
8  Rashmi   43     4001.0  401.0    4402.0
--------------------------------------------
Filtered Data Frames..
    Name  Age  BasSalary  Perks  TotalSal
2   Jack   34     5500.0  550.0    6050.0
4  Ricky   42     4000.0  400.0    4400.0

In [35]:
print("Filtered Data Frames..")
df_filtered = df[df['TotalSal'] < 6000] 
print(df_filtered)

Filtered Data Frames..
    Name  Age  BasSalary  Perks  TotalSal
1    Tom   28     5000.0  500.0    5500.0
4  Ricky   42     4000.0  400.0    4400.0

### Dropping the rows without values

In [42]:
# Create df
colName = ['Tom', 'Jack', 'Steve', 'Ricky', 'Sachin', 'Suresh', 'Ramesh', 'Rashmi']
colAge  = [28,34,29, None, 29,35,30,43]
colBasSal  = [5000.0, 5500.0, None, 4000.0, 5001.0, 5501.0, 6001, 4001.0]
colPerks   = [500.0, 550.0, 600, 400.0, 501.0, 551.0, 601, 401.0]

df = pd.DataFrame(index=[1, 2, 3, 4, 5, 6, 7, 8], dtype=float)

df['Name'] = colName
df['Age'] = colAge
df['BasSalary'] = colBasSal
df['Perks'] = colPerks
df['TotalSal'] = df['BasSalary'] + df['Perks']

print(df)
print("Total rows: ", len(df))
print("----------------------")
df.dropna(inplace=True)
print(df)
print("Total rows: ", len(df))

     Name   Age  BasSalary  Perks  TotalSal
1     Tom  28.0     5000.0  500.0    5500.0
2    Jack  34.0     5500.0  550.0    6050.0
3   Steve  29.0        NaN  600.0       NaN
4   Ricky   NaN     4000.0  400.0    4400.0
5  Sachin  29.0     5001.0  501.0    5502.0
6  Suresh  35.0     5501.0  551.0    6052.0
7  Ramesh  30.0     6001.0  601.0    6602.0
8  Rashmi  43.0     4001.0  401.0    4402.0
Total rows:  8
----------------------
     Name   Age  BasSalary  Perks  TotalSal
1     Tom  28.0     5000.0  500.0    5500.0
2    Jack  34.0     5500.0  550.0    6050.0
5  Sachin  29.0     5001.0  501.0    5502.0
6  Suresh  35.0     5501.0  551.0    6052.0
7  Ramesh  30.0     6001.0  601.0    6602.0
8  Rashmi  43.0     4001.0  401.0    4402.0
Total rows:  6

### Extracting a new Data Frame with different column set from existing data frame

In [43]:
# Create df
colName = ['Tom', 'Jack', 'Steve', 'Ricky', 'Sachin', 'Suresh', 'Ramesh', 'Rashmi']
colAge  = [28,34,29, 42, 29,35,30,43]
colBasSal  = [5000.0, 5500.0, 6000, 4000.0, 5001.0, 5501.0, 6001, 4001.0]
colPerks   = [500.0, 550.0, 600, 400.0, 501.0, 551.0, 601, 401.0]

df = pd.DataFrame(index=[1, 2, 3, 4, 5, 6, 7, 8], dtype=float)

df['Name'] = colName
df['Age'] = colAge
df['BasSalary'] = colBasSal
df['Perks'] = colPerks
df['TotalSal'] = df['BasSalary'] + df['Perks']

print(df)
print("Total rows: ", len(df))
print("----------------------")
df1 = pd.DataFrame(index=[1, 2, 3, 4, 5, 6, 7, 8], dtype=float)
df1['Name'] = df['Name']
df1['TotalSal'] = df['TotalSal']
print(df1)

     Name  Age  BasSalary  Perks  TotalSal
1     Tom   28     5000.0  500.0    5500.0
2    Jack   34     5500.0  550.0    6050.0
3   Steve   29     6000.0  600.0    6600.0
4   Ricky   42     4000.0  400.0    4400.0
5  Sachin   29     5001.0  501.0    5502.0
6  Suresh   35     5501.0  551.0    6052.0
7  Ramesh   30     6001.0  601.0    6602.0
8  Rashmi   43     4001.0  401.0    4402.0
Total rows:  8
----------------------
     Name  TotalSal
1     Tom    5500.0
2    Jack    6050.0
3   Steve    6600.0
4   Ricky    4400.0
5  Sachin    5502.0
6  Suresh    6052.0
7  Ramesh    6602.0
8  Rashmi    4402.0